{"route":
	[
		{
			"title":"Magnet Man",
			"steps":[
				"The only magnet dude you need to shoot is the 2nd",
				"Slide underneath proto so you can shoot him in the back(!!)",
				"On yoku 3, wait for the 3rd block before jumping into the pit",
				"On the guy guarding magnet man, damage boost off the missile",
				"When MM's in the air, go right beneath him"
			]
		},
		{
			"title":"Hard Man",
			"steps":[
				"Switch to magnet immediately",
				"Bees take 3 magnets: shoot 1, then 2 more when the first hits",
				"Coil before the 3rd bee, bounce up and buster him",
				"Dboost off of hammer joe 1",
				"Kill the first monkey, aggro the second and escape",
				"Back to Buster at midpoint",
				"Top route: take etank",
				"It's possible to slide past the last bee bomb",
				"Idk what to do against this proto man. Pray??",
				"SLOW magnet shots against hard man. SLOW!!!!"
			]
		},
		{
			"title":"Top Man",
			"steps":[
				"2-met room, dboost on the first one to go through the shots of the 2nd one",
				"Cats, 2 slow magnets, then rapid when you're up close",
				"Switch to buster in room after cat 2",
				"Hard after tops",
				"Get in close, 2 tops in first cycle, Top man spins away, 2 more hard shots, ded"
			]
		},
		{
			"title":"Shadow Man",
			"steps":[
				"Slide underneath proto so you can shoot him in the back(!!)",
				"Switch to magnets after the 4 mini item energies, use them on the leaping things",
				"And on the parachutes",
				"Switch to top after you cross the pool of lava",
				"The boss fight looks really ad hoc, just Don't Stop Topping"
			]
		},
		{
			"title":"Gemini Man",
			"steps":[
				"Switch to magnet at some point, before that idk even",
				"Make sure you start the slide to skip Proto Man as late as possible",
				"There are zips in this stage! Hello darkness my old friend!",
				"Keep coil out for most of the bubbles",
				"Once you are over the sea, get Shadow Blade out",
				"Slide on all the blocks!!!!",
				"Gemini fight is tough and you might have like 0 health",
				"Use an E-tank? Idk."
			]
		},
		{
			"title":"Needle Man",
			"steps":[
				"For the first 4 porcupines, get Gem Laser out and point-blank them",
				"Switch to magnet at the start of screen 2",
				"Dboos through the porcupine after the big needles (get hit by a quill(????))",
				"2 point-blank magnets each to kill the joes",
				"Point-blank lasers to kill needle man will help avoid Nudua Lasers"
			]
		},
		{
			"title":"Snake Man",
			"steps":[
				"Buster killes everything on screen 1 with 1 or 2 shots, go for it",
				"On the last hump, switch to jet",
				"On 3 snake head screen, jump and kill the first head, then jet over the other 2",
				"Jet over the big head",
				"Slide right as the vaulters vault and you'll go right under",
				"Dboost on the joe, then fly over him",
				"Fly over the next one, and the snake head too",
				"Fly to the top on the two-column screen",
				"Fly over the last screen",
				"Switch to needle in the boss corridor",
				"Fire slowly but not too slowly to kill the snek"
			]
		},
		{
			"title":"Spark Man",
			"steps":[
				"Shoot plugs as they come out of the tubes",
				"Switch to magnet at the end of that room",
				"Dboost through the met forklift",
				"Switch to shadow blade after the garbage blocks",
				"Shoot blades pretty quickly to kill Spark"
			]
		},
		{
			"title":"Doc Gemini",
			"steps":[
				"Should be able to buster everybody except the really high floaty guy",
				"After the buncha pits, magnet",
				"Needle after you run out of magnet",
				"Keep the needles out to kill flash",
				"Switch to jet right after",
				"**INSERT COMPLICATED DBOOST STRAT HERE**",
				"Shadow blades in a later room",
				"Go low in the room with the crawly flashy dudes",
				"Blades kill bubble"
			]
		},
		{
			"title":"Doc Shadow",
			"steps":[
				"Sound glitch!",
				"There's a dboost against one of the one-eye walky guys, don't take it",
				"You should be at 100% for Wood Man",
				"Get pretty close",
				"Shoot right after he shoots his shield, your needle should hit him",
				"Take the hit, then get rl close and needle him all over",
				"When he makes his second shield, take the hit and slide through him",
				"He will ignore you from now on, so kill him long range",
				"Fuck yeah",
				"Switch to magnet immediately, 2hk the joes",
				"Magnet everything, get pickups, magnet even more",
				"Switch to top, annihilate heat man, but be careful of course"
			]
		},
		{
			"title":"Doc Spark",
			"steps":[
				"Coil immediately, gem laser on the ladder",
				"Keep laser out to kill the plugs",
				"Also use it on the springy assholes, 3/per",
				"Magnets for metal, dodge in place, fire slowly",
				"Switch to snake, don't let his body hit you, if his boomerang hits that's okay"
			]
		},
		{
			"title":"Doc Needle",
			"steps":[
				"Gem laser immediately, same as last time",
				"Coil before the 4 big needles",
				"Dboost off of big spring, coil up, coil up, blaster the porcupine",
				"Switch to sparks for air man, Air Man Ga Taosenai",
				"Switch to jet, fly along the top of the screen, jumping all the while",
				"Jet up the screen after, next screen switch to snake",
				"Snakes kill the Big Mets right quick",
				"Switch to hard in the boss corridor",
				"Jump and hit him during his jump, then twice on the floor, then once again in the air maybe"
			]
		},
		{
			"title":"Wily 1",
			"steps":[
				"Dboost past tops",
				"Slide on fish-spikes with dboosting",
				"Switch to magnet during the long climb",
				"Kill all but 1 joe with magnets, jet over the last one",
				"Jet through the Yoku room",
				"Top spin kills the turtles"
			]
		},
		{
			"title":"Wily 2",
			"steps":[
				"Shadow blade after the first row of chompers",
				"Switch to jet after the bees are safely dead",
				"Then, back to shadow to get the quick kill on Devil 3",
				"Chill in the corner after it's filled",
				"Then jump twice, firing upwards madly"
			]
		},
		{
			"title":"Wily 3",
			"steps":[
				"Coil coil coil",
				"Go low in the long room",
				"Take the hit from the 2nd stomper",
				"Clone man: jump to the floating block, get rush there, bounce, shoot at the top clone",
				"Really quickly switch to top, watch him die.",
				"If it doesn't work, just top him"
			]
		},
		{
			"title":"Wily 4",
			"steps":[
				"TR Needle kills Snake",
				"BR Top kills Shadow",
				"B Hard kills Top",
				"B Magnet kills Hard",
				"BL Gem kills Gemini",
				"TL Gem kills Needle",
				"L Shadow kills Magnet (in 4!!)",
				"R Shadow kills Spark",
				"Refill Top Spin"
			]
		},
		{
			"title":"Wily 5",
			"steps":[
				"Snakes kill the gun",
				"Dboost, jump when he goes low, snakes kill the top part too"
			]
		},
		{
			"title":"Wily 6",
			"steps":[
				"Shadow in corridor",
				"7 blades kill phase 1",
				"Switch to top or snake, finish him"
			]
		}
	]
}